Revit 2026 API

# FilterNumericValueRule Class

---

Base for all classes that use a FilterNumericRuleEvaluator to perform their comparisons

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterNumericValueRule Autodesk.Revit.DBFilterDoubleRule Autodesk.Revit.DBFilterElementIdRule Autodesk.Revit.DBFilterGlobalParameterAssociationRule Autodesk.Revit.DBFilterIntegerRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterNumericValueRule : FilterValueRule
```
```vb
Public Class FilterNumericValueRule
	Inherits FilterValueRule
```
```cpp
public ref class FilterNumericValueRule : public FilterValueRule
```
```fsharp
type FilterNumericValueRule =
    class
        inherit FilterValueRule
    end
```

The FilterNumericValueRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterRule) |
|  | ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. (Inherited from FilterRule) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetEvaluator | Gets the evaluator that implements the test for this rule. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. (Inherited from FilterRule) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetEvaluator | Sets the evaluator that implements the test for this rule. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace